Tekla Open API Reference for Tekla Structures 2025
Plane.Origin Property
 The origin of the plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Origin { get; set; }
Public Property Origin As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
Plane Class
Tekla.Structures.Model Namespace